#+TITLE: Week 9.22 Math Homework
#+AUTHOR: 2024110144 陈有骏
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \setCJKmainfont{WenQuanYi Zen Hei}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
9.22 2.6 1-22 mod 3 2.7 1-15 mod 5
2.6 starts from P84, problems at P89
#+end_comment

*** 10
$y'=y(3-ty), y(0)=0.5$
$y_{n+1}=y_n+h(y_n(3-t_ny_n))$
$y_0=0.5, t_0=0$

#+begin_src scheme :results value :exports both
  (define (f t y)
    (* y (- 3 (* t y))))
  (define y0 0.5) ; initial y value when t is the first element in t-lst
  (define t-lst '(0.5 1.0 1.5 2.0 2.5 3.0)) ; where we want to get the y value
  (define h-lst '(0.1 0.05 0.025 0.01)) ; this is for different h exploring

  (define (get-y-next y-current h t-current)
    (+ y-current (* h (- 3 (* t-current y-current)))))

  (define (gen-y-lst h)
    (let loop ((y-current-lst (list y0))
	       (t-current-lst t-lst))
      (if (< (length y-current-lst) (1+ (length t-lst)))
	  (loop (cons
		 (get-y-next (car y-current-lst) h (car t-current-lst))
		 y-current-lst)
		(cdr t-current-lst))
	  (cons (format #f "h=~a" h) y-current-lst))))

  (map-in-order gen-y-lst h-lst)
#+end_src

#+RESULTS:
| h=0.1   |          1.1496075 |           1.213725 |             1.2183 |       1.147875 |     0.9975 |   0.775 | 0.5 |
| h=0.05  |  0.957330498046875 | 0.9498005859374999 |       0.9140578125 |    0.848953125 |   0.755625 |  0.6375 | 0.5 |
| h=0.025 | 0.7703782630920409 |  0.751760284423828 | 0.7218776367187499 | 0.680923828125 | 0.62953125 | 0.56875 | 0.5 |
| h=0.01  | 0.6194216860068751 |    0.6076512226875 |       0.5924627925 |    0.573941625 |   0.552225 |  0.5275 | 0.5 |

